<template>
    <button
          id="btn-สร้างใบเบิกค่าใช้จ่าย"
          class="btn-สร้างใบเบิกค่าใช้จ่าย bg-green text-white rounded-[6px] h-[40px] w-[185px] flex items-center text-[14px] font-thin"
        >
        <svg class="mr-[8px] ml-[16px]" xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
          <path d="M10.7143 11.2857V7.71429C10.7143 7.52485 10.639 7.34316 10.5051 7.20921C10.3711 7.07525 10.1894 7 10 7C9.81056 7 9.62888 7.07525 9.49492 7.20921C9.36097 7.34316 9.28571 7.52485 9.28571 7.71429V11.2857H5.71429C5.52485 11.2857 5.34316 11.361 5.20921 11.4949C5.07525 11.6289 5 11.8106 5 12C5 12.1894 5.07525 12.3711 5.20921 12.5051C5.34316 12.639 5.52485 12.7143 5.71429 12.7143H9.28571V16.2857C9.28571 16.4752 9.36097 16.6568 9.49492 16.7908C9.62888 16.9247 9.81056 17 10 17C10.1894 17 10.3711 16.9247 10.5051 16.7908C10.639 16.6568 10.7143 16.4752 10.7143 16.2857V12.7143H14.2857C14.4752 12.7143 14.6568 12.639 14.7908 12.5051C14.9247 12.3711 15 12.1894 15 12C15 11.8106 14.9247 11.6289 14.7908 11.4949C14.6568 11.361 14.4752 11.2857 14.2857 11.2857H10.7143Z" fill="white"/>
          <path d="M10 21C14.9706 21 19 16.9706 19 12C19 7.02944 14.9706 3 10 3C5.02944 3 1 7.02944 1 12C1 16.9706 5.02944 21 10 21Z" stroke="white" stroke-width="2"/>
        </svg>
  <slot>สร้างใบเบิกค่าใช้จ่าย</slot>
    </button>
  </template>
  
  <script>
  export default {
    name: 'BtnExpenseDoc',
    props: {
      type: {
        type: String,
        default: 'primary'
      },
    },
    computed: {
      buttonClasses() {
        return {
          [`btn-${this.type}`]: this.type,
        }
      }
    }
  }
  </script>